Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/view/index.po
Languages: es

source: Views
es: Vistas

source: Ubiquity uses Twig as the default template engine (see `Twig documentation <https://twig.symfony.com/doc/2.x/>`_). |br| The views are located in the **app/views** folder. They must have the **.html** extension for being interpreted by Twig.
es: Ubiquity utiliza Twig como motor de plantillas por defecto (ver `Documentación de Twig <https://twig.symfony.com/doc/2.x/>`_). |br| Las vistas se encuentran en la carpeta **app/views**. Deben tener la extensión **.html** para ser interpretadas por Twig.

source: Ubiquity can also be used with a PHP view system, to get better performance, or simply to allow the use of php in the views.
es: Ubiquity también se puede utilizar con un sistema de vistas PHP, para obtener un mejor rendimiento, o simplemente para permitir el uso de php en las vistas.

source: Loading
es: Carga

source: Views are loaded from controllers:
es: Las vistas se cargan desde los controladores:

source: Default view loading
es: Carga de la vista por defecto

source: If you use the default view naming method : |br| The default view associated to an action in a controller is located in ``views/controller-name/action-name`` folder:
es: Si se utiliza el método de nomenclatura de vistas por defecto : |br| La vista por defecto asociada a una acción en un controlador se encuentra en la carpeta ``views/nombre-controlador/nombre-acción``:

source: Loading and passing variables
es: Carga y paso de variables

source: Variables are passed to the view with an associative array. Each key creates a variable of the same name in the view.
es: Las variables se pasan a la vista con una matriz asociativa. Cada clave crea una variable del mismo nombre en la vista.

source: In this case, it is usefull to call Compact for creating an array containing variables and their values :
es: En este caso, es útil llamar a Compact para crear un array que contenga variables y sus valores :

source: Displaying in view
es: Mostrar en vista

source: The view can then display the variables:
es: A continuación, la vista puede mostrar las variables:

source: Variables may have attributes or elements you can access, too.
es: Las variables también pueden tener atributos o elementos a los que se puede acceder.

source: You can use a dot (.) to access attributes of a variable (methods or properties of a PHP object, or items of a PHP array), or the so-called "subscript" syntax ([]):
es: Puede utilizar un punto (.) para acceder a los atributos de una variable (métodos o propiedades de un objeto PHP, o elementos de un array PHP), o la llamada sintaxis de "subíndice" ([]):

source: Ubiquity extra functions
es: Funciones adicionales de Ubiquity

source: Global ``app`` variable provides access to predefined Ubiquity Twig features:
es: La variable global ``app`` proporciona acceso a funciones predefinidas de Ubiquity Twig:

source: ``app`` is an instance of ``Framework`` and provides access to public methods of this class.
es: ``app`` es una instancia de ``Framework`` y proporciona acceso a los métodos públicos de esta clase.

source: Get framework installed version:
es: Obtener la versión instalada del framework:

source: Return the active controller and action names:
es: Devuelve el controlador activo y los nombres de las acciones:

source: Return global wrapper classes :
es: Devolver clases envolventes globales :

source: For request:
es: Para request:

source: For session :
es: Para sesión

source: see `Framework class in API <https://api.kobject.net/ubiquity/class_ubiquity_1_1core_1_1_framework.html>`_ for more.
es: véase `Framework class in API <https://api.kobject.net/ubiquity/class_ubiquity_1_1core_1_1_framework.html>`_ para más información.

source: PHP view loading
es: Carga de vistas PHP

source: Disable if necessary Twig in the configuration file by deleting the **templateEngine** key.
es: Desactive si es necesario Twig en el archivo de configuración borrando la clave **templateEngine**.

source: Then create a controller that inherits from ``SimpleViewController``, or ``SimpleViewAsyncController`` if you use **Swoole** or **Workerman**:
es: Luego crea un controlador que herede de ``SimpleViewController``, o ``SimpleViewAsyncController`` si usas **Swoole** o **Workerman**:

source: In this case, the functions for loading assets and themes are not supported.
es: En este caso, las funciones para cargar assets y temas no son compatibles.

source: Assets correspond to javascript files, style sheets, fonts, images to include in your application. |br| They are located from the **public/assets** folder. |br| It is preferable to separate resources into sub-folders by type.
es: Los Assets corresponden a archivos javascript, hojas de estilo, fuentes, imágenes para incluir en tu aplicación. |br| Se ubican desde la carpeta **public/assets**. |br| Es preferible separar los recursos en subcarpetas por tipo.

source: Integration of css or js files :
es: Integración de archivos css o js :

source: CDN with extra parameters:
es: CDN con parámetros adicionales:

source: The themes are totally useless if you only have one presentation to apply.
es: Los temas son totalmente inútiles si sólo tienes una presentación que aplicar.

source: Ubiquity support themes wich can have it's own assets and views according to theme template to be rendered by controller. Each controller action can render a specific theme, or they can use the default theme configured at *config.php* file in ``templateEngineOptions => array("activeTheme" => "semantic")``.
es: Ubiquity soporta temas que pueden tener sus propios activos y vistas de acuerdo a la plantilla del tema para ser renderizados por el controlador. Cada acción del controlador puede renderizar un tema específico, o pueden utilizar el tema por defecto configurado en el archivo *config.php* en ``templateEngineOptions => array("activeTheme" => "semantic")``.

source: Ubiquity is shipped with 3 default themes : **Bootstrap**, **Foundation** and **Semantic-UI**.
es: Ubiquity se entrega con 3 temas por defecto : **Bootstrap**, Foundation** y Semantic-UI**.

source: Installing a theme
es: Instalar un tema

source: With devtools, run :
es: Con devtools, ejecute :

source: The installed theme is one of **bootstrap**, **foundation** or **semantic**.
es: El tema instalado es uno de **bootstrap**, **foundation** o **semantic**.

source: With **webtools**, you can do the same, provided that the **devtools** are installed and accessible (Ubiquity folder added in the system path) :
es: Con **webtools**, puede hacer lo mismo, siempre que las **devtools** estén instaladas y accesibles (carpeta Ubiquity añadida en la ruta del sistema) :

source: Creating a new theme
es: Crear un nuevo tema

source: Creating a new theme from Bootstrap, Semantic...
es: Creación de un nuevo tema a partir de Bootstrap, Semantic...

source: With **webtools** :
es: Con **webtools** :

source: Theme functioning and structure
es: Funcionamiento y estructura del tema

source: Structure
es: Estructura

source: The views of a theme are located from the **app/views/themes/theme-name** folder
es: Las vistas de un tema se encuentran en la carpeta **app/views/themes/theme-name**.

source: The controller base class is responsible for loading views to define the header and footer of each page :
es: La clase base controlador se encarga de cargar las vistas para definir la cabecera y el pie de cada página :

source: The assets of a theme are created inside ``public/assets/theme-name`` folder.
es: Los assets de un tema se crean dentro de la carpeta ``public/assets/theme-name``.

source: The structure of the assets folder is often as follows :
es: La estructura de la carpeta de assets suele ser la siguiente :

source: Change of the active theme
es: Cambio del tema activo

source: Persistent change
es: Cambio persistente

source: **activeTheme** is defined in ``app/config/config.php`` with ``templateEngineOptions => array("activeTheme" => "semantic")``
es: **activeTheme** se define en ``app/config/config.php`` con ``templateEngineOptions => array("activeTheme" => "semantic")``

source: The active theme can be changed with **devtools** :
es: El tema activo puede cambiarse con **devtools** :

source: It can also be done from the home page, or with **webtools** :
es: También puede hacerse desde la página de inicio, o con **webtools** :

source: **From the home page :**
es: **Desde la página de inicio:**

source: **From the webtools :**
es: **Desde Webtools**

source: This change can also be made at runtime :
es: Este cambio también puede hacerse en tiempo de ejecución :

source: **From a controller :**
es: **Desde un controlador :**

source: Non-persistent local change
es: Cambio local no persistente

source: To set a specific theme for all actions within a controller, the simplest method is to override the controller's **initialize** method :
es: Para establecer un tema específico para todas las acciones dentro de un controlador, el método más sencillo es anular el método **initialize** del controlador :

source: Or if the change should only concern one action :
es: O si el cambio sólo debe afectar a una acción :

source: Conditional theme change, regardless of the controller :
es: Cambio de tema condicional, independientemente del controlador :

source: Example with a modification of the theme according to a variable passed in the URL
es: Ejemplo con una modificación del tema en función de una variable pasada en la URL

source: Mobile device support
es: Compatibilidad con dispositivos móviles

source: Add a mobile device detection tool. |br| Installing MobileDetect:
es: Añadir una herramienta de detección de dispositivos móviles. |br| |nstalación de MobileDetect:

source: It is generally easier to create different views per device.
es: En general, es más fácil crear vistas diferentes por dispositivo.

source: Create a specific theme for the mobile part (by creating a folder ``views/themes/mobile`` and putting the views specific to mobile devices in it). |br| It is important in this case to use the same file names for the mobile and non-mobile part.
es: Crear un tema específico para la parte móvil (creando una carpeta ``views/themes/mobile`` y poniendo en ella las vistas específicas para dispositivos móviles). |br| Es importante en este caso utilizar los mismos nombres de archivo para la parte móvil y la parte no móvil.

source: It is also advisable in this case that all view loadings use the **@activeTheme** namespace:
es: También es aconsejable en este caso que todas las cargas de vistas utilicen el espacio de nombres **@activeTheme**:

source: **index.html** must be available in this case in the folders ``views`` and ``views/themes/mobile``.
es: **index.html** debe estar disponible en este caso en las carpetas ``views`` y ``views/themes/mobile``.

source: Global mobile detection (from services.php)
es: Detección global de móviles (desde services.php)

source: Locale detection (from a controller)
es: Detección de configuración regional (desde un controlador)

source: View and assets loading
es: Vista y carga de assets

source: For loading a view from the **activeTheme** folder, you can use the **@activeTheme** namespace :
es: Para cargar una vista desde la carpeta **activeTheme**, puede utilizar el espacio de nombres **@activeTheme** :

source: If the **activeTheme** is **bootstrap**, the loaded view is ``app/views/themes/bootstrap/action.html``.
es: Si el **activeTheme** es **bootstrap**, la vista cargada es ``app/views/themes/bootstrap/action.html``.

source: If you follow the Ubiquity view naming model, the default view loaded for an action in a controller when a theme is active is : ``app/views/themes/theme-name/controller-name/action-name.html``.
es: Si sigues el modelo de nomenclatura de vistas de Ubiquity, la vista cargada por defecto para una acción en un controlador cuando un tema está activo es : ``app/views/themes/theme-name/controller-name/action-name.html``.

source: For example, if the activeTheme is bootstrap, the default view for the action display in the Users controller must be loacated in ``app/views/themes/bootstrap/Users/display.html``.
es: Por ejemplo, si el activeTheme es bootstrap, la vista por defecto para la acción display en el controlador Users debe estar localizada en ``app/views/themes/bootstrap/Users/display.html``.

source: The devtools commands to create a controller or an action and their associated view use the **@activeTheme** folder if a theme is active.
es: Los comandos devtools para crear un controlador o una acción y su vista asociada utilizan la carpeta **@activeTheme** si hay un tema activo.

source: Assets loading
es: Carga de assets

source: The mechanism is the same as for the views : ``@activeTheme`` namespace refers to the ``public/assets/theme-name/`` folder
es: El mecanismo es el mismo que para las vistas: el espacio de nombres ``@activeTheme`` hace referencia a la carpeta ``public/assets/theme-name/``.

source: If the **bootstrap** theme is active, |br| the assets folder is ``public/assets/bootstrap/``.
es: Si el tema **bootstrap** está activo, la carpeta de activos es ``public/assets/bootstrap/``.

source: Css compilation
es: Compilación css

source: For Bootstrap or foundation, install sass:
es: Para Bootstrap o foundation, instala sass:

source: Then run from the project root folder:
es: A continuación, ejecute desde la carpeta raíz del proyecto:

source: **For bootstrap:**
es: **Para bootstrap:**

source: **For foundation:**
es: **Para la fundation:**
