Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/contents/transformers.po
Languages: es

source: The Transformers module uses the static class **TransformersManager** to manage data transformations.
es: El módulo Transformers utiliza la clase estática **TransformersManager** para gestionar las transformaciones de datos.

source: Transformers are used to transform datas after loading from the database, or before displaying in a view.
es: Los transformers se utilizan para transformar los datos después de cargarlos desde la base de datos o antes de mostrarlos en una vista.

source: Adding transformers
es: Añadir transformers

source: Either the **Author** class that we want to use in our application :
es: O bien la clase **Author** que queremos utilizar en nuestra aplicación :

source: Attributes
es: Atributos

source: Annotations
es: Anotaciones (Annotations)

source: We added a transformer on the **name** member with the **@transformer** annotation, in order to capitalize the name in the views.
es: Añadimos un transformer en el miembro **name** con la anotación **@transformer**, para poner el nombre en mayúsculas en las vistas.

source: Generating cache
es: Generar caché

source: Run this command in console mode to create the cache data of the **Author** class :
es: Ejecute este comando en modo consola para crear los datos de caché de la clase **Author** :

source: transformer cache is generated with model metadatas in ``app/cache/models/Author.cache.php``.
es: La caché del transformer se genera con metadatos del modelo en ``app/cache/models/Author.cache.php``.

source: Transformers informations can be displayed with devtools :
es: La información de los transformers puede visualizarse con devtools :

source: Using transformers
es: Uso de transformers

source: Start the **TransformersManager** in the file `app/config/services.php`:
es: Inicie el **TransformersManager** en el archivo `app/config/services.php`:

source: You can test the result in the administration interface:
es: Puede comprobar el resultado en la interfaz de administración:

source: or by creating a controller:
es: o creando un controlador:

source: Transformer types
es: Tipos de transformers

source: The **transform** type is based on the **TransformerInterface** interface. It is used when the transformed data must be converted into an object. |br| The **DateTime** transformer is a good example of such a transformer:
es: El tipo **transform** se basa en la interfaz **TransformerInterface**. Se utiliza cuando los datos transformados deben convertirse en un objeto. |brl El transformador **DateTime** es un buen ejemplo de este tipo de transformador:

source: When loading the data, the Transformer converts the date from the database into an instance of php DateTime.
es: Al cargar los datos, el Transformador convierte la fecha de la base de datos en una instancia de php DateTime.

source: Its **reverse** method performs the reverse operation (php date to database compatible date).
es: Su método **reverse** realiza la operación inversa (fecha php a fecha compatible con la base de datos).

source: The **toView** type is based on the **TransformerViewInterface** interface. It is used when the transformed data must be displayed in a view. |br|
es: El tipo **toView** se basa en la interfaz **TransformerViewInterface**. Se utiliza cuando los datos transformados deben mostrarse en una vista. |br|

source: The **toForm** type is based on the **TransformerFormInterface** interface. It is used when the transformed data must be used in a form. |br|
es: El tipo **toForm** se basa en la interfaz **TransformerFormInterface**. Se utiliza cuando los datos transformados deben utilizarse en un formulario. |br|

source: Transformers usage
es: Uso de transformers

source: Transform on data loading
es: Transformación en la carga de datos

source: If ommited, default **transformerOp** is **transform**
es: Si se omite, **transformerOp** por defecto es **transform**.

source: Set transformerOp to **toView**
es: Establecer transformerOp a **toView**

source: Transform after loading
es: Transformación tras la carga

source: Return the transformed member value:
es: Devuelve el valor transformado del miembro:

source: Return a transformed value:
es: Devuelve un valor transformado:

source: Transform an instance by applying all defined transformers:
es: Transforma una instancia aplicando todos los transformers definidos:

source: Existing transformers
es: Transformers existentes

source: Type(s)
es: Tipo(s)

source: Description
es: Descripción

source: Transform a database datetime to a php DateTime object
es: Transformar una fecha y hora de una base de datos en un objeto DateTime de php

source: Make the member value uppercase
es: Poner el valor en mayúsculas

source: Make the member value lowercase
es: Poner el valor en minúsculas

source: Make the member value first character uppercase
es: Poner en mayúsculas el primer carácter del valor

source: Mask the member characters
es: Enmascarar los caracteres

source: Hash the value with md5
es: Hashear el valor con md5

source: Create your own
es: Cree personalizado

source: Creation
es: Creación

source: Create a transformer to display a user name as a local email address:
es: Crear un transformador para mostrar un nombre de usuario como una dirección de correo electrónico local:

source: Registration
es: Registro

source: Register the transformer by executing the following script:
es: Registre el transformador ejecutando el siguiente script:

source: Usage
es: Uso

source: **Smith** user name will be displayed as **smith@mydomain.local**.
es: El nombre de usuario **Smith** aparecerá como **smith@mydomain.local**.
