Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/contents/validators.po
Languages: es

source: Validators
es: Validators (Validadores)

source: The Validators module uses the static class **ValidatorsManager** to manage validation.
es: El módulo Validators utiliza la clase estática **ValidatorsManager** para gestionar la validación.

source: Validators are used to check that the member datas of an object complies with certain constraints.
es: Los validadores se utilizan para comprobar que los datos de los miembros de un objeto cumplen ciertas restricciones.

source: Adding validators
es: Añadir validadores

source: Either the **Author** class that we want to use in our application :
es: O bien la clase **Author** que queremos utilizar en nuestra aplicación :

source: We added a validation constraint on the **name** member with the **@validator** annotation, so that it is not empty.
es: Hemos añadido una restricción de validación en el miembro **name** con la anotación **@validator**, para que no esté vacío.

source: Generating cache
es: Generar caché

source: Run this command in console mode to create the cache data of the **Author** class :
es: Ejecute este comando en modo consola para crear los datos de caché de la clase **Author** :

source: Validator cache is generated in ``app/cache/contents/validators/models/Author.cache.php``.
es: La caché del validador se genera en ``app/cache/contents/validators/models/Author.cache.php``.

source: Validating instances
es: Validación de instancias

source: an instance
es: una instancia

source: if the **name** of the author is empty, this action should display:
es: si el **nombre** del autor está vacío, esta acción debe mostrarse:

source: The **validate** method returns an array of **ConstraintViolation** instances.
es: El método **validate** devuelve una matriz de instancias **ConstraintViolation**.

source: multiple instances
es: instancias multiples

source: Models generation with default validators
es: Generación de modelos con validadores por defecto

source: When classes are automatically generated from the database, default validators are associated with members, based on the fields' metadatas.
es: Cuando las clases se generan automáticamente a partir de la base de datos, se asocian validadores por defecto a los miembros, en función de los metadatos de los campos.

source: These validators can then be modified. |br| Modifications must always be folowed by a re-initialization of the model cache.
es: Estos validadores pueden ser modificados. |br| Las modificaciones siempre deben ir seguidas de una reinicialización de la caché del modelo.

source: Models validation informations can be displayed with devtools :
es: La información sobre la validación de los modelos puede visualizarse con devtools :

source: Gets validators on email field:
es: Obtener validadores en campo email:

source: Validation informations are also accessible from the **models** part of the webtools:
es: También se puede acceder a la información de validación desde la parte **modelos** de las webtools:

source: Validator types
es: Tipos de validadores

source: Validator
es: Validador

source: Constraints
es: Restricciones

source: Accepted values
es: Valores aceptados

source: Check if value is a boolean
es: Verifica si el valor es un booleano

source: Check if value is empty
es: Verifica si el valor está vacío

source: Check if value is false
es: Verifica si el valor es falso

source: Check if value is null
es: Verifica si el valor es nulo

source: Check if value is true
es: Verifica si el valor es verdadero

source: Check if value is not empty
es: Verifica si el valor no está vacío

source: Check if value is not null
es: Verifica si el valor no es nulo

source: type
es: tipo

source: Check if value is of type {type}
es: Verifica si el valor es del tipo {type}

source: Comparison
es: Comparación

source: Dates
es: Fechas

source: Multiples
es: Múltiples

source: Strings
es: Cadenas
