Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/security/acl.po
Languages: es

source: ACL management
es: Gestión de ACL

source: Installation
es: Instalación

source: Install the **Ubiquity-acl** module from the command prompt or from the **Webtools** (Composer part).
es: Instale el módulo **Ubiquity-acl** desde el símbolo del sistema o desde **Webtools** (parte Composer).

source: Then activate the display of the Acl part in the **Webtools**:
es: A continuación, active la visualización de la parte Acl en el **Webtools**:

source: ACL interface in **webtools**:
es: Interfaz ACL en **webtools**:

source: Acl Rules
es: Normas Acl

source: ACLs are used to define access to an Ubiquity application. They are defined according to the following principles:
es: Las ACL se utilizan para definir el acceso a una aplicación Ubiquity. Se definen de acuerdo con los siguientes principios:

source: An Ubiquity application is composed of :
es: Una aplicación Ubiquity se compone de :

source: **Resources** (possibly controllers, or actions of these controllers)
es: **Recursos** (posiblemente controladores, o acciones de estos controladores)

source: **Roles**, possibly assigned to users. Each **Role** can inherit parent roles.
es: **Roles**, posiblemente asignados a usuarios. Cada **Rol** puede heredar roles padre.

source: **Permissions**, which correspond to a right to do. Each permission has a level (represented by an integer value).
es: **Permisos**, que corresponden a un derecho a hacer. Cada permiso tiene un nivel (representado por un valor entero).

source: Additional rules:
es: Normas adicionales:

source: An AclElement (**Allow**) grants Permission to a Role on a Resource.
es: Un AclElement (**Allow**) concede Permiso a un Rol sobre un Recurso.

source: Each role inherits authorisations from its parents, in addition to its own.
es: Cada rol hereda autorizaciones de sus padres, además de las suyas propias.

source: If a role has a certain level of access permission on a resource, it will also have all the permissions of a lower level on that resource.
es: Si un rol tiene un determinado nivel de permiso de acceso sobre un recurso, también tendrá todos los permisos de un nivel inferior sobre ese recurso.

source: The association of a resource and a permission to a controller or a controller action defines a **map** element.
es: La asociación de un recurso y un permiso a un controlador o a una acción de controlador define un elemento **map**.

source: Naming tips:
es: Consejos para poner nombres:

source: Role, in capital letters, beginning with an arobase (@USER, @ADMIN, @ALL...).
es: Rol, en mayúsculas, empezando por una arroba (@USER, @ADMIN, @ALL...).

source: Permissions, in upper case, named using a verb (READ, WRITE, OPEN...).
es: Permisos, en mayúsculas, nombrados con un verbo (READ, WRITE, OPEN...).

source: Resource, capitalized on the first letter (Products, Customers...)
es: Recurso, con mayúscula inicial (Products, Customers...)

source: ACL Starting
es: Inicio de ACL

source: The **AclManager** service can be started directly from the **webtools** interface, in the **Security** part.
es: El servicio **AclManager** puede iniciarse directamente desde la interfaz **webtools**, en la parte **Security**.

source: The service is started in the ``services.php`` file.
es: El servicio se inicia en el archivo ``services.php``.

source: This default provider allows you to manage ACLs defined through attributes or annotations.
es: Este proveedor predeterminado permite gestionar ACLs definidas mediante atributos o anotaciones.

source: An AclController enables automatic access management based on ACLs to its own resources. |br| It is possible to create them automatically from **webtools**.
es: Un AclController permite la gestión automática del acceso basado en ACLs a sus propios recursos. |br| Es posible crearlas automáticamente desde **webtools**.

source: But it is just a basic controller, using the AclControllerTrait feature.
es: Pero es sólo un controlador básico, utilizando la característica AclControllerTrait.

source: This controller just goes to redefine the ``_getRole`` method, so that it returns the role of the active user, for example.
es: Este controlador sólo va a redefinir el método ``_getRole``, para que devuelva el rol del usuario activo, por ejemplo.

source: Authorisation has been granted for the resource:
es: Se ha concedido autorización para el recurso:

source: Without specifying the resource, the controller's actions are defined as a resource.
es: Sin especificar el recurso, las acciones del controlador se definen como un recurso.

source: Without specifying the permission, the ``ALL`` permission is used.
es: Sin especificar el permiso, se utiliza el permiso ``ALL``.

source: And this association is present in the Acls map:
es: Y esta asociación está presente en el mapa de Acls:

source: AclController with authentication
es: AclController con autenticación

source: The use of both ``WithAuthTrait`` and ``AclControllerTrait`` requires to remove the ambiguity about the ``isValid`` method.
es: El uso tanto de ``WithAuthTrait`` como de ``AclControllerTrait`` requiere eliminar la ambigüedad sobre el método ``isValid``.

source: Allow with Role, resource and permission
es: Permitir con función, recurso y permiso

source: Allow without prior creation:
es: Permitir sin creación previa:

source: ``@USER`` is allowed to access to ``Foo`` resource with ``READ`` permission.
es: ``@USER`` puede acceder al recurso ``Foo`` con permiso ``READ``.

source: The role, resource and permission are automatically created as soon as they are invoked with ``Allow``.
es: El rol, el recurso y el permiso se crean automáticamente en cuanto se invocan con ``Allow``.

source: Allow with explicit creation:
es: Permitir con creación explícita:

source: Adding ACL at runtime
es: Añadir ACL en tiempo de ejecución

source: Whether in a controller or in a service, it is possible to add Roles, Resources, Permissions and Authorizations at runtime:
es: Ya sea en un controlador o en un servicio, es posible añadir Roles, Recursos, Permisos y Autorizaciones en tiempo de ejecución:

source: For example :\\ Adding a Role ``@USER`` inheriting from ``@GUEST``.
es: Por ejemplo: Añadir un rol ``@USER`` que herede de ``@GUEST``.

source: Defining ACLs with Database
es: Definición de ACL con base de datos

source: The ACLs defined in the database are additional to the ACLs defined via annotations or attributes.
es: Las ACLs definidas en la base de datos son adicionales a las ACLs definidas mediante anotaciones o atributos.

source: Initializing
es: Inicialización

source: The initialization allows to create the tables associated to the ACLs (Role, Resource, Permission, AclElement). It needs to be done only once, and in dev mode only.
es: La inicialización permite crear las tablas asociadas a las ACLs (Role, Resource, Permission, AclElement). Debe realizarse una sola vez, y únicamente en modo dev.

source: To place for example in ``app/config/bootstrap.php`` file:
es: Para colocar por ejemplo en el archivo ``app/config/bootstrap.php`` :

source: Starting
es: Comenzando

source: In ``app/config/services.php`` file :
es: En el archivo ``app/config/services.php`` :

source: Strategies for defining ACLs
es: Estrategias para definir ACLs

source: With few resources:
es: Con pocos recursos:

source: Defining authorisations for each controller's action or action group:
es: Definición de autorizaciones para cada acción o grupo de acciones del controlador:

source: Resources logically correspond to controllers, and permissions to actions. But this rule may not be respected, and an action may be defined as a resource, as required.
es: Los recursos corresponden lógicamente a los controladores, y los permisos a las acciones. Pero esta regla puede no respetarse, y una acción puede definirse como un recurso, según sea necesario.

source: The only mandatory rule is that a Controller/action pair can only correspond to one Resource/permission pair (not necessarily unique).
es: La única regla obligatoria es que un par Controlador/acción sólo puede corresponder a un par Recurso/permiso (no necesariamente único).

source: With more resources:
es: Con más recursos:
