Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/security/index.po
Languages: es

source: Security
es: Seguridad

source: Guiding principles
es: Principios guía

source: Forms validation
es: Validación de formularios

source: Client-side validation
es: Validación del cliente

source: It is preferable to perform an initial client-side validation to avoid submitting invalid data to the server.
es: Es preferible realizar una validación inicial en el lado del cliente para evitar enviar datos no válidos al servidor.

source: Example of the creation of a form in the action of a controller (this part could be located in a dedicated service for a better separation of layers):
es: Ejemplo de creación de un formulario en la acción de un controlador (esta parte podría ubicarse en un servicio dedicado para una mejor separación de capas):

source: The Associated View:
es: La Vista Asociada:

source: The CRUD controllers automatically integrate this client-side validation using the Validators attached to the members of the models.
es: Los controladores CRUD integran automáticamente esta validación del lado del cliente utilizando los validadores adjuntos a los miembros de los modelos.

source: Server-side validation
es: Validación en el servidor

source: It is preferable to restrict the URLs allowed to modify data. |br| Beforehand, by specifying the Http method in the routes, and by testing the request :
es: Es preferible restringir las URL autorizadas a modificar los datos. |br| Previamente, especificando el método Http en las rutas, y probando la petición :

source: The **Ubiquity-security** module offers additional control to avoid cross-site requests.
es: El módulo **Ubiquity-security** ofrece un control adicional para evitar las peticiones cross-site.

source: After modifying an object, it is possible to check its validity, given the validators attached to the members of the associated Model:
es: Tras modificar un objeto, es posible comprobar su validez, dados los validadores adjuntos a los miembros del Modelo asociado:

source: DAO operations
es: Operaciones DAO

source: It is always recommended to use parameterized queries, regardless of the operations performed on the data:
es: Siempre se recomienda utilizar consultas parametrizadas, independientemente de las operaciones que se realicen con los datos:

source: To avoid SQL injections.
es: Para evitar inyecciones SQL.

source: To allow the use of prepared queries, speeding up processing.
es: Permitir el uso de consultas preparadas, acelerando el procesamiento.

source: DAO operations that take objects as parameters use this mechanism by default.
es: Las operaciones DAO que toman objetos como parámetros utilizan este mecanismo por defecto.

source: Passwords management
es: Gestión de contraseñas

source: The ``Password`` Transformer allows a field to be of the password type when displayed in an automatically generated CRUD form.
es: El transformador ``Contraseña`` permite que un campo sea de tipo contraseña cuando se muestra en un formulario CRUD generado automáticamente.

source: After submission from a form, it is possible to encrypt a password from the URequest class:
es: Tras el envío desde un formulario, es posible encriptar una contraseña desde la clase URequest:

source: The algorithm used in this case is defined by the php ``PASSWORD_DEFAULT``.
es: El algoritmo utilizado en este caso está definido por el ``PASSWORD_DEFAULT`` de php.

source: It is also possible to check a password entered by a user in the same way, to compare it to a hash:
es: También es posible comprobar una contraseña introducida por un usuario del mismo modo, para compararla con un hash:

source: Set up Https to avoid sending passwords in clear text.
es: Configure Https para evitar el envío de contraseñas en texto claro.

source: Security module/ ACL management
es: Módulo de seguridad/gestión ACL

source: In addition to these few rules, you can install if necessary:
es: Además de estas pocas reglas, puede instalar si es necesario:
