Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/security/module.po
Languages: es

source: Security module
es: Módulo de seguridad

source: Installation
es: Instalación

source: Install the Ubiquity-security module from the command prompt or from the **Webtools** (Composer part).
es: Instale el módulo Ubiquity-security desde la línea de comandos o desde **Webtools** (parte Composer).

source: Then activate the display of the Security part in the **Webtools**:
es: A continuación, active la visualización de la parte Seguridad en el **Webtools**:

source: Session CSRF
es: CSRF de Sesión

source: The session is by default protected against CSRF attacks via the ``VerifyCsrfToken`` class (even without the **Ubiquity-security** module). |br| A token instance (``CSRFToken``) is generated at the session startup. The validity of the token is then checked via a cookie at each request.
es: La sesión está protegida por defecto contra ataques CSRF mediante la clase ``VerifyCsrfToken`` (incluso sin el módulo **Ubiquity-security**). |Se genera una instancia del token (``CSRFToken``) al iniciar la sesión. La validez del token se comprueba mediante una cookie en cada petición.

source: This protection can be customized by creating a class implementing the ``VerifySessionCsrfInterface``.
es: Esta protección puede personalizarse creando una clase que implemente la ``VerifySessionCsrfInterface``.

source: Starting the custom protection in services:
es: Iniciar la protección personalizada en los servicios:

source: Deactivating the protection
es: Desactivar la protección

source: If you do not need to protect your session against Csrf attacks, start the session with the ``NoCsrfProtection`` class.
es: Si no necesita proteger su sesión contra ataques Csrf, inicie la sesión con la clase ``NoCsrfProtection``.

source: CSRF manager
es: Gestor de CSRF

source: The **CsrfManager** service can be started directly from the **webtools** interface. |br| Its role is to provide tools to protect sensitive routes from Csrf attacks (the ones that allow the validation of forms for example).
es: El servicio **CsrfManager** puede iniciarse directamente desde la interfaz **webtools**. |br| Su papel es proporcionar herramientas para proteger las rutas sensibles de los ataques Csrf (los que permiten la validación de formularios por ejemplo).

source: The service is started in the ``services.php`` file.
es: El servicio se inicia en el archivo ``services.php``.

source: Example of form protection:
es: Ejemplo de protección de formularios:

source: The form view:
es: La vista del formulario:

source: The ``csrf`` method generates a token for the form (By adding a hidden field in the form corresponding to the token.).
es: El método ``csrf`` genera un token para el formulario (Añadiendo un campo oculto en el formulario correspondiente al token).

source: The form submitting in a controller:
es: El formulario de envío en un controlador:

source: It is also possible to manage this protection via cookie.
es: También es posible gestionar esta protección mediante cookies.

source: Example of protection with ajax:
es: Ejemplo de protección con ajax:

source: The meta field ``csrf-token`` is generated on all pages.
es: El meta campo ``csrf-token`` se genera en todas las páginas.

source: This field is added in the headerView:
es: Este campo se añade en el headerView:

source: Example with a button posting data via ajax. The parameter ``csrf`` is set to true. So when the request is posted, the ``csrf-token`` is sent in the request headers.
es: Ejemplo con un botón que envía datos vía ajax. El parámetro ``csrf`` se establece en true. Así que cuando se envía la solicitud, el ``csrf-token`` se envía en las cabeceras de la solicitud.

source: The submitting route can check the presence and validity of the token:
es: La ruta de envío puede comprobar la presencia y validez del token:

source: Encryption manager
es: Gestor de cifrado

source: The **EncryptionManager** service can be started directly from the **webtools** interface.
es: El servicio **EncryptionManager** puede iniciarse directamente desde la interfaz **webtools**.

source: In this case, a key is generated in the configuration file ``app/config/config.php``.
es: En este caso, se genera una clave en el archivo de configuración ``app/config/config.php``.

source: By default, encryption is performed in ``AES-128``.
es: Por defecto, el cifrado se realiza en ``AES-128``.

source: Changing the cipher:
es: Cambiando el cifrado:

source: Upgrade to AES-256:
es: Actualización a AES-256:

source: Generate a new key:
es: Generar una nueva clave:

source: The new key is generated in the ``app/config/config.php`` file.
es: La nueva clave se genera en el archivo ``app/config/config.php``.

source: Cookie encryption
es: Encriptación de cookies

source: Cookies can be encrypted by default, by adding this in ``services.php``:
es: Las cookies pueden ser encriptadas por defecto, añadiendo esto en ``services.php``:

source: Model data encryption
es: Modelo de encriptación de datos

source: The ``Crypt`` transformer can also be used on the members of a model:
es: El transformador ``Crypt`` también puede utilizarse en los miembros de un modelo:

source: Usage:
es: Uso:

source: Generic Data encryption
es: Cifrado genérico de datos

source: Strings encryption:
es: Cifrado de cadenas:

source: To then decrypt it:
es: Para luego desencriptarlo:

source: It is possible to encrypt any type of data:
es: Es posible cifrar cualquier tipo de datos:

source: To then decrypt it, with possible serialisation/deserialisation if it is an object:
es: Para luego desencriptarlo, con posible serialización/deserialización si se trata de un objeto:

source: Content Security Policies manager
es: Gestor de políticas de seguridad de contenidos

source: The **ContentSecurityManager** service can be started directly from the **webtools** interface.
es: El servicio **ContentSecurityManager** puede iniciarse directamente desde la interfaz **webtools**.

source: With this default configuration, a nonce is added to jquery scripts generated with phpmv-ui. CSP control is done in Report-only mode..
es: Con esta configuración por defecto, se añade un nonce a los scripts jquery generados con phpmv-ui. El control de CSP se realiza en el modo Report-only..

source: Adding a nonce
es: Añadir un nonce

source: Example of adding nonce on the header and footer pages:
es: Ejemplo de adición de nonce en las páginas de cabecera y pie de página:

source: Updating the base controller
es: Actualización del controlador de base

source: Adding the nonce in the header and footer views
es: Añadir el nonce en las vistas de cabecera y pie de página

source: Password management
es: Gestión de contraseñas

source: Users token
es: Tokens de usuario
