Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/scaffolding/auth.po
Languages: es

source: Auth Controllers
es: Controladores de autenticación (Auth Controllers)

source: The Auth controllers allow you to perform basic authentification with:
es: Los controladores Auth permiten realizar una autentificación básica con:

source: login with an account
es: iniciar sesión con una cuenta

source: account creation
es: creación de cuenta

source: logout
es: cierre de sesión

source: controllers with required authentication
es: controladores con autenticación requerida

source: Creation
es: Creación

source: In the admin interface (web-tools), activate the **Controllers** part, and choose create **Auth controller**:
es: En la interfaz de administración (web-toolsb), active la parte **Controllers** y seleccione crear **Auth controller**:

source: Then fill in the form:
es: A continuación, rellene el formulario:

source: Enter the controller name (BaseAuthController in this case)
es: Introduzca el nombre del controlador (BaseAuthController en este caso)

source: The generated controller:
es: El controlador generado:

source: Implementation of the authentification
es: Aplicación de la autentificación

source: Example of implementation with the administration interface : We will add an authentication check on the admin interface.
es: Ejemplo de implementación con la interfaz de administración : Añadiremos una comprobación de autenticación en la interfaz de administración.

source: Authentication is based on verification of the email/password pair of a model **User**:
es: La autenticación se basa en la verificación del par correo electrónico/contraseña de un modelo **User**:

source: BaseAuthController modification
es: Modificación de BaseAuthController

source: Admin controller modification
es: Modificación del controlador de administración

source: Modify the Admin Controller to use BaseAuthController:
es: Modificar el controlador de administración para utilizar BaseAuthController:

source: Test the administration interface at **/admin**:
es: Pruebe la interfaz de administración en **/admin**:

source: After clicking on **login**:
es: Después de hacer clic en **login**:

source: If the authentication data entered is invalid:
es: Si los datos de autenticación introducidos no son válidos:

source: If the authentication data entered is valid:
es: Si los datos de autenticación introducidos son válidos:

source: Attaching the zone info-user
es: Adjuntar la zona info-user

source: Modify the **BaseAuthController** controller:
es: Modificar el controlador **BaseAuthController**:

source: The **_userInfo** area is now present on every page of the administration:
es: El área **_userInfo** está ahora presente en todas las páginas de la administración:

source: It can be displayed in any twig template:
es: Puede mostrarse en cualquier plantilla twig:

source: Description of the features
es: Descripción de las características

source: Customizing templates
es: Personalización de plantillas

source: index.html template
es: plantilla index.html

source: The index.html template manages the connection:
es: La plantilla index.html gestiona la conexión:

source: Example with the **_userInfo** area:
es: Ejemplo con el área **_userInfo**:

source: Create a new AuthController named **PersoAuthController**:
es: Cree un nuevo AuthController llamado **PersoAuthController**:

source: Edit the template **app/views/PersoAuthController/info.html**
es: Editar la plantilla **app/views/PersoAuthController/info.html**

source: Change the AuthController **Admin** controller:
es: Cambiar el controlador AuthController **Admin**:

source: Customizing messages
es: Personalización de los mensajes

source: Self-check connection
es: Conexión de autocomprobación

source: Limitation of connection attempts
es: Limitación de los intentos de conexión

source: Account recovery
es: Recuperación de cuenta

source: account recovery is used to reset the account password. |br| A password reset email is sent, to an email address corresponding to an active account.
es: La recuperación de cuenta se utiliza para restablecer la contraseña de la cuenta. |br| Se envía un correo electrónico de restablecimiento de contraseña, a una dirección de correo electrónico correspondiente a una cuenta activa.

source: By default, the link can only be used on the same machine, within a predetermined period of time (which can be modified by overriding the ``accountRecoveryDuration`` method).
es: Por defecto, el enlace sólo puede utilizarse en la misma máquina, dentro de un periodo de tiempo predeterminado (que puede modificarse anulando el método ``accountRecoveryDuration``).

source: Activation of MFA/2FA
es: Activación de MFA/2FA

source: Multi-factor authentication can be enabled conditionally, based on the pre-logged-in user's information.
es: La autenticación multifactor puede activarse condicionalmente, en función de la información del usuario previamente registrado.

source: Phase 2 of the authentication is done in the example below by sending a random code by email. The AuthMailerClass class is available in the ``Ubiquity-mailer`` package.
es: La fase 2 de la autenticación se realiza en el siguiente ejemplo enviando un código aleatorio por correo electrónico. La clase AuthMailerClass está disponible en el paquete ``Ubiquity-mailer``.

source: It is possible to customize the creation of the generated code, as well as the prefix used. The sample below is implemented with ``robthree/twofactorauth`` library.
es: Es posible personalizar la creación del código generado, así como el prefijo utilizado. El ejemplo de abajo está implementado con la librería ``robthree/twofactorauth``.

source: Account creation
es: Creación de cuenta

source: The activation of the account creation is also optional:
es: La activación de la creación de la cuenta también es opcional:

source: In this case, the _create method must be overridden in order to create the account:
es: En este caso, debe sobrescribirse el método _create para crear la cuenta:

source: You can check the validity/availability of the login before validating the account creation form:
es: Puede comprobar la validez/disponibilidad del login antes de validar el formulario de creación de cuenta:

source: A confirmation action (email verification) may be requested from the user:
es: Se puede solicitar al usuario una acción de confirmación (verificación por correo electrónico):

source: It is possible to customize these parts by overriding the associated methods, or by modifying the interfaces in the concerned templates.
es: Es posible personalizar estas partes anulando los métodos asociados o modificando las interfaces en las plantillas correspondientes.
