Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/controller/router.po
Languages: es

source: Router
es: Ruteo (Router)

source: Routing can be used in addition to the default mechanism that associates ``controller/action/{parameters}`` with an url. |br|
es: El enrutamiento se puede utilizar además del mecanismo por defecto que asocia ``controller/action/{parameters}`` con una url. |br|

source: Dynamic routes
es: Rutas dinámicas

source: Dynamic routes are defined at runtime. |br| It is possible to define these routes in the **app/config/services.php** file.
es: Las rutas dinámicas se definen en tiempo de ejecución. |br| Es posible definir estas rutas en el archivo **app/config/services.php**.

source: Dynamic routes should only be used if the situation requires it:
es: Las rutas dinámicas sólo deben utilizarse si la situación lo requiere:

source: in the case of a micro-application
es: en el caso de una microaplicación

source: if a route must be dynamically defined
es: si una ruta debe definirse dinámicamente

source: In all other cases, it is advisable to declare the routes with annotations, to benefit from caching.
es: En todos los demás casos, es aconsejable declarar las rutas con anotaciones, para beneficiarse del almacenamiento en caché.

source: Callback routes
es: Rutas de devolución de llamadas (callback)

source: The most basic Ubiquity routes accept a Closure. |br| In the context of micro-applications, this method avoids having to create a controller.
es: Las rutas más básicas de Ubiquity aceptan un Closure. |br| En el contexto de las microaplicaciones, este método evita tener que crear un controlador.

source: Callback routes can be defined for all http methods with:
es: Se pueden definir rutas de devolución de llamada para todos los métodos http con:

source: Controller routes
es: Rutas de controlador

source: Routes can also be associated more conventionally with an action of a controller:
es: Las rutas también pueden asociarse de forma más convencional a una acción de un controlador:

source: The method ``FooController::index()`` will be accessible via the url ``/bar``.
es: El método ``FooController::index()`` será accesible a través de la url ``/bar``.

source: In this case, the **FooController** must be a class inheriting from **Ubiquity\\controllers\\Controller** or one of its subclasses, and must have an **index** method:
es: En este caso, el **FooController** debe ser una clase que herede de **Ubiquity\controllers\\Controller** o una de sus subclases, y debe tener un método **index**:

source: Default route
es: Ruta por defecto

source: The default route matches the path **/**. |br| It can be defined using the reserved path **_default**
es: La ruta por defecto coincide con la ruta **/**. |br| Puede definirse utilizando la ruta reservada **_default**.

source: Static routes
es: Rutas estáticas

source: Static routes are defined using annotation or with php native attributes since ``Ubiquity 2.4.0``.
es: Las rutas estáticas se definen mediante anotaciones o con atributos nativos de php desde ``Ubiquity 2.4.0``.

source: These annotations or attributes are never read at runtime. |br| It is necessary to reset the router cache to take into account the changes made on the routes.
es: Estas anotaciones o atributos nunca se leen en tiempo de ejecución. |br| Es necesario reiniciar la caché del enrutador para tener en cuenta los cambios realizados en las rutas.

source: Creation
es: Creación

source: Attributes
es: Atributos

source: Annotations
es: Anotaciones

source: The method ``Products::index()`` will be accessible via the url ``/products``.
es: El método ``Products::index()`` será accesible a través de la url ``/products``.

source: The initial or terminal slash is ignored in the path. The following routes are therefore equivalent: |br|
es: La barra inicial o terminal se ignora en la ruta. Por lo tanto, las siguientes rutas son equivalentes: |br|

source: Route parameters
es: Parámetros de ruta

source: A route can have parameters:
es: Una ruta puede tener parámetros:

source: Route optional parameters
es: Parámetros opcionales de ruta

source: A route can define optional parameters, if the associated method has optional arguments:
es: Una ruta puede definir parámetros opcionales, si el método asociado tiene argumentos opcionales:

source: Route requirements
es: Requisitos de ruta

source: It is possible to add specifications on the variables passed in the url via the attribute **requirements**.
es: Es posible añadir especificaciones sobre las variables pasadas en la url mediante el atributo **requirements**.

source: The defined route matches these urls:
es: La ruta definida coincide con estas urls:

source: but not with that one:
es: pero no con ese:

source: Parameter typing
es: Tipificación de parámetros

source: The route declaration takes into account the data types passed to the action, which avoids adding requirements for simple types (int, bool, float).
es: La declaración de ruta tiene en cuenta los tipos de datos pasados a la acción, lo que evita añadir requisitos para tipos simples (int, bool, float).

source: Correct values by data type:
es: Valores correctos por tipo de datos:

source: Route http methods
es: Métodos http de enrutado

source: It is possible to specify the http method or methods associated with a route:
es: Es posible especificar el método o métodos http asociados a una ruta:

source: The **methods** attribute can accept several methods: |br| ``@route("testMethods","methods"=>["get","post","delete"])`` |br| ``#[Route('testMethods', methods: ['get','post','delete'])]``
es: El atributo **methods** puede aceptar varios métodos: |br| ``@route("testMethods", "methods"=>["get", "post", "delete"])`` |br| ``#[Route('testMethods', methods: ['get','post','delete'])]``

source: The **@route** annotation or **Route** attribute defaults to all HTTP methods. |br| There is a specific annotation for each of the existing HTTP methods:
es: La anotación **@route** o atributo **Route** se aplica por defecto a todos los métodos HTTP. |br| Existe una anotación específica para cada uno de los métodos HTTP existentes:

source: Route name
es: Nombre de ruta

source: It is possible to specify the **name** of a route, this name then facilitates access to the associated url. |br| If the **name** attribute is not specified, each route has a default name, based on the pattern **controllerName_methodName**.
es: Es posible especificar el **name** de una ruta, este nombre facilita entonces el acceso a la url asociada. |br| Si no se especifica el atributo **name**, cada ruta tiene un nombre por defecto, basado en el patrón **controllerName_methodName**.

source: URL or path generation
es: Generación de URL o rutas

source: Route names can be used to generate URLs or paths.
es: Los nombres de ruta pueden utilizarse para generar URL o rutas.

source: Linking to Pages in Twig
es: Enlaces a páginas en Twig

source: Global route
es: Ruta global

source: The **@route** annotation can be used on a controller class :
es: La anotación **@route** puede utilizarse en una clase de controlador :

source: In this case, the route defined on the controller is used as a prefix for all controller routes : |br| The generated route for the action **display** is ``/product/all``
es: En este caso, la ruta definida en el controlador se utiliza como prefijo para todas las rutas del controlador : |br| La ruta generada para la acción **display** es ``/product/all``.

source: automated routes
es: rutas automatizadas

source: If a global route is defined, it is possible to add all controller actions as routes (using the global prefix), by setting the **automated** parameter :
es: Si se define una ruta global, es posible añadir todas las acciones del controlador como rutas (utilizando el prefijo global), estableciendo el parámetro **automated** :

source: The **automated** attribute defines the 3 routes contained in **ProductsController**:
es: El atributo **automated** define las 3 rutas contenidas en **ProductsController**:

source: inherited routes
es: rutas heredadas

source: With the **inherited** attribute, it is also possible to generate the declared routes in the base classes, or to generate routes associated with base class actions if the **automated** attribute is set to true in the same time.
es: Con el atributo **inherited**, también es posible generar las rutas declaradas en las clases base, o generar rutas asociadas a acciones de clases base si el atributo **automated** se establece a true al mismo tiempo.

source: The base class:
es: La clase base:

source: The derived class using inherited members:
es: La clase derivada que utiliza miembros heredados:

source: The **inherited** attribute defines the 2 routes defined in **ProductsBase**:
es: El atributo **inherited** define las 2 rutas definidas en **ProductsBase**:

source: If the **automated** and **inherited** attributes are combined, the base class actions are also added to the routes.
es: Si se combinan los atributos **automated** y **inherited**, las acciones de la clase base también se añaden a las rutas.

source: Global route parameters
es: Parámetros de ruta globales

source: The global part of a route can define parameters, which will be passed in all generated routes. |br| These parameters can be retrieved through a public data member:
es: La parte global de una ruta puede definir parámetros, que serán pasados en todas las rutas generadas. |br| Estos parámetros se pueden recuperar a través de un miembro de datos público:

source: Accessing the url ``/foo/bar/display`` displays the contents of the bar member.
es: Accediendo a la url ``/foo/bar/display`` se muestra el contenido del miembro bar.

source: Route without global prefix
es: Ruta sin prefijo global

source: If the global route is defined on a controller, all the generated routes in this controller are preceded by the prefix. |br| It is possible to explicitly introduce exceptions on some routes, using the ``#/`` prefix.
es: Si la ruta global se define en un controlador, todas las rutas generadas en este controlador irán precedidas del prefijo. |br| Es posible introducir explícitamente excepciones en algunas rutas, utilizando el prefijo ``#/``.

source: The controller defines the ``/noRoot`` url, which is not prefixed with the ``/foo`` part.
es: El controlador define la url ``/noRoot``, que no está prefijada con la parte ``/foo``.

source: Route priority
es: Prioridad de ruta

source: The **prority** parameter of a route allows this route to be resolved in a priority order.
es: El parámetro **prority** de una ruta permite resolver esta ruta en un orden de prioridad.

source: The higher the priority parameter, the more the route will be defined at the beginning of the stack of routes in the cache.
es: Cuanto mayor sea el parámetro de prioridad, más se definirá la ruta al principio de la pila de rutas en la caché.

source: In the example below, the **products/all** route will be defined before the **/products** route.
es: En el ejemplo siguiente, la ruta **products/all** se definirá antes que la ruta **products**.

source: The default priority value is ``0``.
es: El valor de prioridad por defecto es ``0``.

source: Routes response caching
es: Caché de respuesta de rutas

source: It is possible to cache the response produced by a route:
es: Es posible almacenar en caché la respuesta producida por una ruta:

source: In this case, the response is cached and is no longer dynamic.
es: En este caso, la respuesta se almacena en caché y deja de ser dinámica.

source: Cache duration
es: Duración de la caché

source: The **duration** is expressed in seconds, if it is omitted, the duration of the cache is infinite.
es: La **duración** se expresa en segundos, si se omite, la duración de la caché es infinita.

source: Cache expiration
es: Expiración de la caché

source: It is possible to force reloading of the response by deleting the associated cache.
es: Es posible forzar la recarga de la respuesta borrando la caché asociada.

source: Dynamic routes caching
es: Cacheo dinámico de rutas

source: Dynamic routes can also be cached.
es: Las rutas dinámicas también pueden almacenarse en caché.

source: This possibility is only useful if this caching is not done in production, but at the time of initialization of the cache.
es: Esta posibilidad sólo es útil si esta caché no se realiza en producción, sino en el momento de inicializar la caché.

source: Checking routes with devtools :
es: Comprobación de rutas con devtools :

source: Error management (404 & 500 errors)
es: Gestión de errores (errores 404 y 500)

source: Default routing system
es: Sistema de enrutamiento por defecto

source: With the default routing system (the controller+action couple defining a route), the error handler can be redefined to customize the error management.
es: Con el sistema de enrutamiento por defecto (la pareja controlador+acción definiendo una ruta), el manejador de errores puede ser redefinido para personalizar la gestión de errores.

source: In the configuration file **app/config/config.php**, add the **onError** key, associated to a callback defining the error messages:
es: En el fichero de configuración **app/config/config.php**, añade la clave **onError**, asociada a un devolucion de llamada (callback) que defina los mensajes de error:

source: Implement the requested action **p404** in the **IndexController**:
es: Implementar la acción solicitada **p404** en el **IndexController**:

source: Routage with annotations
es: Enrutado con anotaciones

source: It is enough in this case to add a last route disabling the default routing system, and corresponding to the management of the 404 error:
es: Basta en este caso con añadir una última ruta deshabilitando el sistema de enrutamiento por defecto, y correspondiente a la gestión del error 404:
