Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/webtools/index.po
Languages: es

source: Webtools allow you to manage an Ubiquity application via a web interface. Since **Ubiquity 2.2.0**, webtools are in a separate `repository <https://github.com/phpMv/ubiquity-webtools>`_.
es: Webtools le permiten gestionar una aplicación Ubiquity a través de una interfaz web. Desde **Ubiquity 2.2.0**, las webtools están en un `repositorio separado <https://github.com/phpMv/ubiquity-webtools>`_.

source: Installation
es: Instalación

source: Update the devtools if necessary to get started:
es: Actualiza las devtools si es necesario para empezar:

source: At the project creation
es: En la creación del proyecto

source: Create a projet with **webtools** (``-a`` option)
es: Crear un proyecto con **webtools** (opción ``-a``)

source: In an existing project
es: En un proyecto existente

source: In a console, go to the project folder and execute:
es: En una consola, vaya a la carpeta del proyecto y ejecútelo:

source: Starting
es: Comenzando

source: Start the embedded web server, from the project folder:
es: Inicie el servidor web integrado, desde la carpeta del proyecto:

source: go to the address: ``http://127.0.0.1:8090/Admin``
es: diríjase a la dirección ``http://127.0.0.1:8090/Admin``

source: Customizing
es: Personalización

source: Click on **customize** to display only the tools you use:
es: Haz clic en **customize** para mostrar sólo las herramientas que utilizas:

source: Webtools modules
es: Módulos Webtools

source: Create a controller (and optionally the view associated to the default **index** action)
es: Crear un controlador (y opcionalmente la vista asociada a la acción **index** por defecto)

source: Create an action in a controller (optionally the associated view, the associated route)
es: Crear una acción en un controlador (opcionalmente la vista asociada, la ruta asociada)

source: Create a special controller (CRUD or Auth)
es: Crear un controlador especial (CRUD o Auth)

source: Test an action (GET, POST...)
es: Probar una acción (GET, POST...)

source: Models
es: Modelos

source: Displays the metadatas of the models, allows to browse the entities.
es: Muestra los metadatos de los modelos, permite navegar por las entidades.

source: Create models from database
es: Crear modelos a partir de la base de datos

source: Generate models cache
es: Generar caché de modelos

source: Generate database script from existing models
es: Generar script de base de datos a partir de modelos existentes

source: Performs CRUD operations on models
es: Realiza operaciones CRUD en los modelos

source: Displays an manage REST services.
es: Muestra y gestiona servicios REST.

source: Re-initialize Rest cache and routes
es: Reiniciar la caché Rest y las rutas

source: Create a new Service (using an api)
es: Crear un nuevo Servicio (utilizando una api)

source: Create a new resource (associated to a model)
es: Crear un nuevo recurso (asociado a un modelo)

source: Test and query a web service using http methods
es: Prueba y consulta de un servicio web mediante métodos http

source: Displays cache files.
es: Muestra los archivos de caché.

source: Delete or re-initialize models cache
es: Borrar o reinicializar la caché de modelos

source: Delete or re-initialize controllers cache
es: Borrar o reinicializar la caché de los controladores

source: Delete other cache files
es: Borrar otros archivos de caché

source: Maintenance
es: Mantenimiento

source: Allows to manage maintenance modes.
es: Permite gestionar los modos de mantenimiento.

source: Create or update a maintenance mode
es: Crear o actualizar un modo de mantenimiento

source: De/Activate a maintenance mode
es: Desactivar/activar un modo de mantenimiento

source: Delete a maintenance mode
es: Borrar un modo de mantenimiento

source: Allows the display and modification of the app configuration.
es: Permite visualizar y modificar la configuración de la aplicación.

source: Synchronizes the project using git.
es: Sincroniza el proyecto utilizando git.

source: Configuration with external repositories
es: Configuración con repositorios externos

source: Manages Css themes.
es: Gestiona temas Css.

source: Install an existing theme
es: Instalar un tema existente

source: Activate a theme
es: Activar un tema

source: Create a new theme (eventually base on an existing theme)
es: Crear un nuevo tema (eventualmente basado en un tema existente)
