Repository: phpMv/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/translation/index.po
Languages: es

source: Translation module
es: Módulo de traducción

source: The Translation module uses the static class **TranslatorManager** to manage translations.
es: El módulo Translation utiliza la clase estática **TranslatorManager** para gestionar las traducciones.

source: Module structure
es: Estructura del módulo

source: Translations are grouped by **domain**, within a **locale** :
es: Las traducciones se agrupan por **dominio**, dentro de una **localidad** :

source: In the translation root directory (default **app/translations**):
es: En el directorio raíz de la traducción (por defecto **app/translations**):

source: Each locale corresponds to a subfolder.
es: Cada configuración regional corresponde a una subcarpeta.

source: For each locale, in a subfolder, a domain corresponds to a php file.
es: Para cada configuración regional, en una subcarpeta, un dominio corresponde a un archivo php

source: each domain file contains an associative array of translations **key-> translation value**
es: cada archivo de dominio contiene una matriz asociativa de traducciones **clave->valor de traducción**

source: Each key can be associated with
es: Cada clave puede asociarse a

source: a translation
es: una traducción

source: a translation containing variables (between **%** and **%**)
es: una traducción que contenga variables (entre **%** y **%**)

source: an array of translations for handle pluralization
es: una matriz de traducciones para manejar la pluralización

source: Starting the module
es: Inicio del módulo

source: Module startup is logically done in the **services.php** file. |br|
es: El arranque del módulo se realiza lógicamente en el archivo **services.php**. |br|

source: With no parameters, the call of the **start** method uses the locale **en_EN**, without fallbacklocale.
es: Sin parámetros, la llamada al método **start** utiliza la configuración regional **en_EN**, sin configuración regional alternativa.

source: The translations module must be started after the cache has started.
es: El módulo de traducciones debe iniciarse después de que se haya iniciado la caché.

source: Setting the locale
es: Configuración regional

source: Changing the locale when the manager starts:
es: Cambiar la configuración regional cuando se inicia el administrador

source: Changing the locale after loading the manager:
es: Cambiar la configuración regional después de cargar el administrador:

source: Setting the fallbackLocale
es: Configuración regional alternativa

source: The **en_EN** locale will be used if **fr_FR** is not found:
es: Se utilizará la configuración regional **en_EN** si no se encuentra **es_ES**:

source: Defining the root translations dir
es: Definición del directorio raíz de las traducciones

source: If the **rootDir** parameter is missing, the default directory used is ``app/translations``.
es: Si falta el parámetro **rootDir**, el directorio utilizado por defecto es ``app/translations``.

source: Make a translation
es: Hacer una traducción

source: With php
es: Con php

source: Translation of the **okayBtn** key into the default locale (specified when starting the manager):
es: Traducción de la tecla **okayBtn** a la configuración regional por defecto (especificada al iniciar el gestor):

source: With no parameters, the call of the **trans** method uses the default locale, the domain **messages**.
es: Sin parámetros, la llamada al método **trans** utiliza la configuración regional por defecto, el dominio **messages**.

source: Translation of the **message** key using a variable:
es: Traducción de la clave **message** mediante una variable:

source: In this case, the translation file must contain a reference to the **user** variable for the key **message**:
es: En este caso, el archivo de traducción debe contener una referencia a la variable **user** para la clave **message**:

source: In twig views:
es: En vistas de twig:
